{
  "backend/main.mo": "Motoko backend managing per-user contacts and call sessions with access control, including create/list/delete contacts and create/join call sessions.",
  "feature_evidence.json": "Machine-generated report mapping implemented features to related source files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining light/dark theme tokens using OKLCH values and applying base styles.",
  "frontend/index.html": "Base HTML entry point setting mobile-friendly meta tags and loading the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all pages with authentication wrapping and global theme/toast providers.",
  "frontend/src/components/AppLayout.tsx": "Provides the shared app layout with header branding and optional auth status display.",
  "frontend/src/components/AuthStatus.tsx": "Displays the signed-in principal and sign-out action, clearing cached queries on logout.",
  "frontend/src/components/CallControls.tsx": "Renders in-call action buttons for mute, camera toggle, speaker placeholder, and ending the call.",
  "frontend/src/components/ContactForm.tsx": "Form for adding a contact with name and handle fields and submission handling.",
  "frontend/src/components/ContactsList.tsx": "Displays a list of contacts with avatars and a delete button, or an empty state if none exist.",
  "frontend/src/components/JoinCodeCard.tsx": "Shows a shareable call link with copy-to-clipboard functionality and visual feedback.",
  "frontend/src/components/LocalVideoPreview.tsx": "Manages and displays a local camera preview with loading, error, and unsupported states.",
  "frontend/src/components/RequireAuth.tsx": "Protects routes by redirecting unauthenticated users and showing a loading state during identity initialization.",
  "frontend/src/components/SessionStatusPanel.tsx": "Displays call session status, timestamps, and peer info with state-based badges and messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useCallSessions.ts": "Provides mutations and queries for creating, joining, ending, and polling call sessions.",
  "frontend/src/hooks/useContacts.ts": "Fetches, creates, and deletes contacts while updating react-query cache and showing toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading via AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CallEndedPage.tsx": "Displays a call-ended message and offers navigation to start a new call or return to contacts.",
  "frontend/src/pages/CallSetupPage.tsx": "Provides UI to create or join a call session using session codes and user names.",
  "frontend/src/pages/ContactsPage.tsx": "Manages and displays contacts with options to create new contacts, delete existing ones, and start new calls.",
  "frontend/src/pages/InCallPage.tsx": "Handles the in-call experience, including video preview, call controls, session state, and ending calls.",
  "frontend/src/pages/SignInPage.tsx": "Renders the sign‑in flow using Internet Identity with a branded welcome screen.",
  "frontend/src/utils/principalFormat.ts": "Shortens a principal ID by returning only its first two segments.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, animations, and content paths.",
  "project_state.json": "JSON metadata describing project version, required images, and a list of existing features for a FaceTime‑like cross‑platform web app, including auth, contacts, UI flows, and call sessions."
}